Config/Documents/ОтражениеЗарплатыВУчете.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ОтражениеЗарплатыВУчете</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.РасшифровкаКУДиР</xr:Item>
				<xr:Item>InformationRegister.ОперацииКапвложений</xr:Item>
				<xr:Item>AccountingRegister.ЖурналПроводокЕПСБУ</xr:Item>
				<xr:Item>AccumulationRegister.КнигаУчетаДоходовИРасходов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИФО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиФинансовогоОбеспечения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПервичногоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПервичногоДокумента</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.НомерПервичногоДокумента</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПервичногоДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмпортированИзЗГУ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГлБухгалтер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Руководитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Операции</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидОперации</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыОперацийОтраженияЗарплаты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИФО</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИсточникиФинансовогоОбеспечения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КФО</Name>
							<Type>
								<v8:Type>cfg:EnumRef.КВД</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КПС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификационныеПризнакиСчетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КЭК</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КОСГУ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Счет</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.ЕПСБУ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто1</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто2</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто3</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Договор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетНУ</Name>
							<Type>
								<v8:TypeSet>cfg:ChartOfAccountsRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоНУ1</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоНУ2</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоНУ3</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтражениеВУСН</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ОтражениеВУСН</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФизическоеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидОперацииПоЗарплатеЗГУ</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыОперацийПоЗарплате</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидОперацииПоЗарплате</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыОперацийПоЗарплате</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяФинансированияЗарплата</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиФинансированияЗарплата</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособОтраженияЗарплатыВБухУчете</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СпособыОтраженияЗарплатыВБухУчете</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПериодПринятияРасходов</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидНачисленияОплатыТрудаДляНУ</Name>
							<Comment>Вид начисления для налогового учета по налогу на прибыль</Comment>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыНачисленийОплатыТрудаДляНУ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОблагаетсяЕНВД</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НДФЛКодПоОКТМО</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>11</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НДФЛКПП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>9</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НДФЛКодНалоговогоОргана</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>4</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЯвляетсяОснованиемОформленияКассовогоЧека</Name>
							<Comment>Является основанием оформления кассового чека</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КЭКСчет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КОСГУ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДопКлассификация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДополнительнаяБюджетнаяКлассификация</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодМероприятия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Мероприятия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодЦели</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыЦелевыхСредств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтразитьВКарточкеКапвложений</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КарточкаКапвложений</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КарточкиКапвложений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Налог</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НалогиИПлатежиОрганизации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КПССчет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификационныеПризнакиСчетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНУ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидНалога</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыНалоговИПлатежей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Config/InformationRegisters/НастройкаСтатейФинансированияЗарплата.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>НастройкаСтатейФинансированияЗарплата</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИФО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиФинансовогоОбеспечения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КФО</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КВД</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КПС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификационныеПризнакиСчетов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СтатьяФинансированияЗарплата</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиФинансированияЗарплата</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийПоЗарплате</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КЭК</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КОСГУ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/InformationRegisters/СоответствиеОперацийУчетаЗарплаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СоответствиеОперацийУчетаЗарплаты</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОперацияБГУ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыОперацийОтраженияЗарплаты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОперацияЗГУ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийПоЗарплате</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/Documents/ОтражениеЗарплатыВУчете/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс	

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
КонецПроцедуры

// Процедура - Заполнить по данным ЗГУ
//
// По переданным из ЗГУ данным вычисляети заполняет реквизиты документа ОтражениеЗарплатыВУчете,
// необходимые для формирования бухгалтерских проводок
//
// Параметры:
//  ДокументДляЗаполнения	 - ДкументОбъект.ОтражениеЗарплатыВУчете или ДанныеФормыСтруктура 
//
Процедура ЗаполнитьПоДаннымЗГУ(ДокументДляЗаполнения) Экспорт
		
	Запрос = Новый Запрос;                                    
	Запрос.УстановитьПараметр("НаДату", ДокументДляЗаполнения.Дата);
	Запрос.Текст = "ВЫБРАТЬ
	               |	НастройкаСпособовОтраженияЗарплатыВБухУчетеСрезПоследних.СпособОтраженияЗарплатыВБухУчете КАК СпособОтражения,
	               |	НастройкаСпособовОтраженияЗарплатыВБухУчетеСрезПоследних.Организация КАК Организация,
	               |	НастройкаСпособовОтраженияЗарплатыВБухУчетеСрезПоследних.КодНалоговогоОргана КАК КодНалоговогоОргана,
	               |	НастройкаСпособовОтраженияЗарплатыВБухУчетеСрезПоследних.ВидОперации КАК ВидОперацииЗГУ,
	               |	НастройкаСпособовОтраженияЗарплатыВБухУчетеСрезПоследних.СчетДт КАК Счет,
	               |	НастройкаСпособовОтраженияЗарплатыВБухУчетеСрезПоследних.Субконто1 КАК Субконто1,
	               |	НастройкаСпособовОтраженияЗарплатыВБухУчетеСрезПоследних.Субконто2 КАК Субконто2,
	               |	НастройкаСпособовОтраженияЗарплатыВБухУчетеСрезПоследних.Субконто3 КАК Субконто3,
	               |	НастройкаСпособовОтраженияЗарплатыВБухУчетеСрезПоследних.СчетНУ КАК СчетНУ,
	               |	НастройкаСпособовОтраженияЗарплатыВБухУчетеСрезПоследних.СубконтоНУ1 КАК СубконтоНУ1,
	               |	НастройкаСпособовОтраженияЗарплатыВБухУчетеСрезПоследних.СубконтоНУ2 КАК СубконтоНУ2,
	               |	НастройкаСпособовОтраженияЗарплатыВБухУчетеСрезПоследних.СубконтоНУ3 КАК СубконтоНУ3,
	               |	НастройкаСпособовОтраженияЗарплатыВБухУчетеСрезПоследних.ОтражениеВУСН КАК ОтражениеВУСН,
	               |	НастройкаСпособовОтраженияЗарплатыВБухУчетеСрезПоследних.КодЦели КАК КодЦели,
	               |	НастройкаСпособовОтраженияЗарплатыВБухУчетеСрезПоследних.КодМероприятия КАК КодМероприятия,
	               |	НастройкаСпособовОтраженияЗарплатыВБухУчетеСрезПоследних.ДопКлассификация КАК ДопКлассификация
	               |ИЗ
	               |	РегистрСведений.НастройкаСпособовОтраженияЗарплатыВБухУчете.СрезПоследних(&НаДату, ) КАК НастройкаСпособовОтраженияЗарплатыВБухУчетеСрезПоследних
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	НастройкаСтатейФинансированияЗарплатаСрезПоследних.СтатьяФинансированияЗарплата КАК СтатьяФинансированияЗГУ,
	               |	НастройкаСтатейФинансированияЗарплатаСрезПоследних.Организация КАК Организация,
	               |	НастройкаСтатейФинансированияЗарплатаСрезПоследних.ВидОперации КАК ВидОперацииЗГУ,
	               |	НастройкаСтатейФинансированияЗарплатаСрезПоследних.КЭК КАК КЭКСтатьи,
	               |	НастройкаСтатейФинансированияЗарплатаСрезПоследних.ИФО КАК ИФО,
	               |	НастройкаСтатейФинансированияЗарплатаСрезПоследних.КФО КАК КФО,
	               |	НастройкаСтатейФинансированияЗарплатаСрезПоследних.КПС КАК КПС
	               |ИЗ
	               |	РегистрСведений.НастройкаСтатейФинансированияЗарплата.СрезПоследних(&НаДату, ) КАК НастройкаСтатейФинансированияЗарплатаСрезПоследних
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СоответствиеОперацийУчетаЗарплаты.ОперацияЗГУ КАК ОперацияЗГУ,
	               |	СоответствиеОперацийУчетаЗарплаты.ОперацияБГУ КАК ОперацияБГУ
	               |ИЗ
	               |	РегистрСведений.СоответствиеОперацийУчетаЗарплаты КАК СоответствиеОперацийУчетаЗарплаты";
					   
	Результат = Запрос.ВыполнитьПакет();
	
	НастройкаСпОтр = Результат[0].Выгрузить();
	НастройкаСпОтр.Индексы.Добавить("СпособОтражения,Организация,КодНалоговогоОргана,ВидОперацииЗГУ");
	
	НастройкаСтФин = Результат[1].Выгрузить();
	НастройкаСтФин.Индексы.Добавить("СтатьяФинансированияЗГУ,Организация,ВидОперацииЗГУ,КЭКСтатьи");			   

	СоответствиеОпераций = Результат[2].Выгрузить();
	СоответствиеОпераций.Индексы.Добавить("ОперацияЗГУ,ОперацияБГУ");	
	
	КЭК213 = Справочники.КОСГУ.НайтиПоКоду("213");
	КЭК210 = БухгалтерскийУчет.СписокКЭК("210");
	
	ВидыОперацийФонды = Документы.ОтражениеЗарплатыВУчете.ПолучитьВидыОперацийФонды();
	
	ВыгруженыДанныеСотрудников = ?(ВыгруженыДанныеСотрудников = Неопределено, Ложь, ВыгруженыДанныеСотрудников);
	
	Для Каждого СтрокаОперации Из ДокументДляЗаполнения.Операции Цикл
		
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("ОперацияЗГУ", СтрокаОперации.ВидОперацииПоЗарплате);
		
		СтрокаСоответствиеОпераций = СоответствиеОпераций.НайтиСтроки(СтруктураОтбора);
		Если СтрокаСоответствиеОпераций.Количество() > 0 Тогда
			СтрокаОперации.ВидОперации = СтрокаСоответствиеОпераций[0].ОперацияБГУ; 	
		КонецЕсли;

		Если КЭК210.Найти(СтрокаОперации.КЭК) <> Неопределено 
			И ВидыОперацийФонды.Найти(СтрокаОперации.ВидОперацииПоЗарплате) <> Неопределено Тогда
			СтрокаОперации.КЭК = КЭК213;
		КонецЕсли;
		
		СтруктураОтбораСтФин = Новый Структура;
		СтруктураОтбораСтФин.Вставить("СтатьяФинансированияЗГУ",СтрокаОперации.СтатьяФинансированияЗарплата);
		СтруктураОтбораСтФин.Вставить("Организация", ДокументДляЗаполнения.Организация);
		СтруктураОтбораСтФин.Вставить("ВидОперацииЗГУ", СтрокаОперации.ВидОперацииПоЗарплате);
		СтруктураОтбораСтФин.Вставить("КЭКСтатьи", СтрокаОперации.КЭК);
		
		СтрокаСтФин = Документы.ОтражениеЗарплатыВУчете.НайтиСтрокуСтФин(СтруктураОтбораСтФин, НастройкаСтФин);
							
		Если СтрокаСтФин.Количество() = 0 Тогда
			Если СтрокаОперации.ВидОперацииПоЗарплате = Перечисления.ВидыОперацийПоЗарплате.НДФЛ 
			И СтрокаОперации.КЭК = КЭК213 Тогда
				СтруктураОтбораСтФин.СтатьяФинансированияЗГУ = Справочники.СтатьиФинансированияЗарплата.УдержанияИзСредствФСС;
				СтрокаСтФин = Документы.ОтражениеЗарплатыВУчете.НайтиСтрокуСтФин(СтруктураОтбораСтФин, НастройкаСтФин);
			КонецЕсли;
		КонецЕсли;
   
		Если СтрокаСтФин.Количество() = 0 Тогда 
			СтруктураОтбораСтФин.КЭКСтатьи = Справочники.КОСГУ.ПустаяСсылка();
			СтрокаСтФин = Документы.ОтражениеЗарплатыВУчете.НайтиСтрокуСтФин(СтруктураОтбораСтФин, НастройкаСтФин);	
		КонецЕсли;
		
		Если СтрокаСтФин.Количество() <> 0 Тогда
			ЗаполнитьЗначенияСвойств(СтрокаОперации, СтрокаСтФин[0]);
		КонецЕсли;
		
		СтруктураОтбораСпОтр = Новый Структура;
		Если СтрокаОперации.СпособОтраженияЗарплатыВБухУчете = Справочники.СпособыОтраженияЗарплатыВБухУчете.ПустаяСсылка()
			И СтрокаОперации.ВидОперацииПоЗарплате = Перечисления.ВидыОперацийПоЗарплате.КомпенсацияЗаЗадержкуЗарплаты Тогда
			СтрокаОперации.СпособОтраженияЗарплатыВБухУчете = Справочники.СпособыОтраженияЗарплатыВБухУчете.КомпенсацияЗаЗадержкуЗарплаты;
		ИначеЕсли СтрокаОперации.СпособОтраженияЗарплатыВБухУчете = Справочники.СпособыОтраженияЗарплатыВБухУчете.ПустаяСсылка()
			И СтрокаОперации.ВидОперацииПоЗарплате = Перечисления.ВидыОперацийПоЗарплате.РасходыПоСтрахованиюФСС Тогда
			СтрокаОперации.СпособОтраженияЗарплатыВБухУчете = Справочники.СпособыОтраженияЗарплатыВБухУчете.РасходыПоСтрахованиюФСС;
		КонецЕсли;
		
		СтруктураОтбораСпОтр.Вставить("СпособОтражения", СтрокаОперации.СпособОтраженияЗарплатыВБухУчете);
		СтруктураОтбораСпОтр.Вставить("Организация", ДокументДляЗаполнения.Организация);
		СтруктураОтбораСпОтр.Вставить("ВидОперацииЗГУ", СтрокаОперации.ВидОперацииПоЗарплате);
		СтруктураОтбораСпОтр.Вставить("КодНалоговогоОргана", СтрокаОперации.НДФЛКодНалоговогоОргана);
		
		СтрокаСпОтр = НастройкаСпОтр.НайтиСтроки(СтруктураОтбораСпОтр);
		
		Если СтрокаСпОтр.Количество() = 0 Тогда 
			СтруктураОтбораСпОтр.КодНалоговогоОргана = "";
			СтрокаСпОтр = НастройкаСпОтр.НайтиСтроки(СтруктураОтбораСпОтр);
		КонецЕсли;
		
		Если СтрокаСпОтр.Количество() > 0 Тогда
			
			СписокСвойств = "Счет,Субконто1,Субконто2,Субконто3";
			
			Если НалоговыйУчетКлиентСервер.ОтражатьВНалоговомУчете(ДокументДляЗаполнения.Организация, ДокументДляЗаполнения.Дата, СтрокаОперации.КФО) Тогда
				СписокСвойств = СписокСвойств + ",СчетНУ,СубконтоНУ1,СубконтоНУ2,СубконтоНУ3,ОтражениеВУСН";
				ЗаполнитьЗначенияСвойств(СтрокаОперации, СтрокаСпОтр[0],СписокСвойств);
			Иначе
				ЗаполнитьЗначенияСвойств(СтрокаОперации, СтрокаСпОтр[0],СписокСвойств);
			КонецЕсли;
		КонецЕсли;
		
		Если ТипЗнч(СтрокаОперации.Субконто2) = Тип("СправочникСсылка.НалогиИПлатежиОрганизации") И ЗначениеЗаполнено(СтрокаОперации.Субконто2) Тогда
			СтрокаОперации.Налог = Справочники.НалогиИПлатежиОрганизации.ПустаяСсылка();
		Иначе
			СтрокаОперации.Налог = Документы.ОтражениеЗарплатыВУчете.НалогСборПлатежПоУмолчанию(ДокументДляЗаполнения.Организация, СтрокаОперации.ВидОперации.ВидНалога);
			СтрокаОперации.ВидНалога = СтрокаОперации.ВидОперации.ВидНалога;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// Создает элементы справочника ДокументыБИА для выгрузки информации в 1С:Архив.
// 
// Параметры:
//  СсылкаНаОбъектИсточник - ОпределяемыйТип.СсылкаНаОбъектИсточникБИА - ссылка на объект,
//   который нужно передать в 1С:Архив.
//
// Возвращаемое значение:
//  Массив из ДокументОбъект.ДокументыБИА - созданные документы.
//
Функция СоздатьДокументыБИА(СсылкаНаОбъектИсточник) Экспорт
	СформированныеДокументыБИА = Новый Массив;
	
	ОбменСАрхивомБГУ.СоздатьДокументыБИАДляДокументаУчета(СсылкаНаОбъектИсточник, СформированныеДокументыБИА);
	
	Возврат СформированныеДокументыБИА;
	
КонецФункции

#КонецОбласти

// Формирует таблицу двдижений по регистру сведений "Операции капвложений"
// Вызывается после формирования таблицы проводок для документа при его проведении
//
// Параметры:
//  ТаблицаПроводок - Таблица значений. Таблица проводок, которые будут сформированы
//  ДокументОбъект - Документ объект. Документ, из которого формируются движения
//  ДополнительныеРеквизиты - Структура. Структура дополнительных реквизитов типовой бухгалтерской операции
//  ТабДвижений - Таблица значений. Исходящая таблица. Ее заполняет эта функция
//  ТекстОшибки - Строка. Исходящая строка, описание ошики. Ее заполняет эта функция, если была ошибка.
//
// Возвращает флаг ошибки. Если Истина - все ОК, иначе - Ложь
Функция ИнициализироватьТабДвиженийДляКарточкиКапвложений(
	ТаблицаПроводок, ДокументОбъект, ДополнительныеРеквизиты, ТабДвижений, ТекстОшибки) Экспорт

	ТекОрганизация = ДокументОбъект.Организация;
	ТекДата        = ДокументОбъект.Дата;
	МассивККВ      = Новый Массив;
	Для каждого СтрокаТЧ из ДокументОбъект.Операции Цикл
		Если НЕ СтрокаТЧ.ОтразитьВКарточкеКапвложений ИЛИ НЕ ЗначениеЗаполнено(СтрокаТЧ.КарточкаКапвложений) Тогда
			Продолжить;
		ИначеЕсли МассивККВ.Найти(СтрокаТЧ.КарточкаКапвложений) <> Неопределено Тогда
			Продолжить;	
		КонецЕсли;	
		
		НоваяСтрока = ТабДвижений.Добавить();
		НоваяСтрока.Организация         = ТекОрганизация;
		НоваяСтрока.КарточкаКапвложений = СтрокаТЧ.КарточкаКапвложений;
		НоваяСтрока.Период              = ТекДата;
		
		МассивККВ.Добавить(СтрокаТЧ.КарточкаКапвложений);
	КонецЦикла;	

	Возврат Истина;
КонецФункции	

#КонецОбласти  

#Область СлужебныеПроцедурыИфункции

Функция НайтиСтрокуСтФин(СтруктураОтбораСтФин, НастройкаСтФин) Экспорт
	
	СтрокаСтФин = НастройкаСтФин.НайтиСтроки(СтруктураОтбораСтФин);
	
	Если СтрокаСтФин.Количество() = 0 Тогда
		СтруктураОтбора = ОбщегоНазначенияКлиентСервер.СкопироватьСтруктуру(СтруктураОтбораСтФин);
		СтруктураОтбора.ВидОперацииЗГУ = Перечисления.ВидыОперацийПоЗарплате.ПустаяСсылка();
		СтрокаСтФин = НастройкаСтФин.НайтиСтроки(СтруктураОтбора);
	КонецЕсли;
	
	Возврат СтрокаСтФин;
КонецФункции

Функция ПолучитьВидыОперацийФонды() Экспорт
	
	ВидыОперацийФонды = Новый Массив;
	ВидыОперацийФонды.Добавить(Перечисления.ВидыОперацийПоЗарплате.ПФРДополнительныйТарифЛЭ);
	ВидыОперацийФонды.Добавить(Перечисления.ВидыОперацийПоЗарплате.ПФРДополнительныйТарифЛЭОценочныеОбязательства);
	ВидыОперацийФонды.Добавить(Перечисления.ВидыОперацийПоЗарплате.ПФРДополнительныйТарифШахтеры);
	ВидыОперацийФонды.Добавить(Перечисления.ВидыОперацийПоЗарплате.ПФРДополнительныйТарифШахтерыОценочныеОбязательства);
	ВидыОперацийФонды.Добавить(Перечисления.ВидыОперацийПоЗарплате.ПФРЗаЗанятыхНаПодземныхИВредныхРаботах);
	ВидыОперацийФонды.Добавить(Перечисления.ВидыОперацийПоЗарплате.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахОценочныеОбязательства);
	ВидыОперацийФонды.Добавить(Перечисления.ВидыОперацийПоЗарплате.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахБезСпецОценки);
	ВидыОперацийФонды.Добавить(Перечисления.ВидыОперацийПоЗарплате.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахБезСпецОценкиОценочныеОбязательства);
	ВидыОперацийФонды.Добавить(Перечисления.ВидыОперацийПоЗарплате.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахСпецОценка);
	ВидыОперацийФонды.Добавить(Перечисления.ВидыОперацийПоЗарплате.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахСпецОценкаОценочныеОбязательства);
	ВидыОперацийФонды.Добавить(Перечисления.ВидыОперацийПоЗарплате.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботах);
	ВидыОперацийФонды.Добавить(Перечисления.ВидыОперацийПоЗарплате.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахОценочныеОбязательства);
	ВидыОперацийФонды.Добавить(Перечисления.ВидыОперацийПоЗарплате.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахБезСпецОценки);
	ВидыОперацийФонды.Добавить(Перечисления.ВидыОперацийПоЗарплате.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахБезСпецОценкиОценочныеОбязательства);
	ВидыОперацийФонды.Добавить(Перечисления.ВидыОперацийПоЗарплате.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахСпецОценка);
	ВидыОперацийФонды.Добавить(Перечисления.ВидыОперацийПоЗарплате.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахСпецОценкаОценочныеОбязательства);
	ВидыОперацийФонды.Добавить(Перечисления.ВидыОперацийПоЗарплате.ПФРНакопительнаяЧасть); 
	ВидыОперацийФонды.Добавить(Перечисления.ВидыОперацийПоЗарплате.ПФРНакопительнаяЧастьОценочныеОбязательства);
	ВидыОперацийФонды.Добавить(Перечисления.ВидыОперацийПоЗарплате.ПФРСПревышения); 
	ВидыОперацийФонды.Добавить(Перечисления.ВидыОперацийПоЗарплате.ПФРСПревышенияОценочныеОбязательства);
	ВидыОперацийФонды.Добавить(Перечисления.ВидыОперацийПоЗарплате.ПФРДоПредельнойВеличины);
	ВидыОперацийФонды.Добавить(Перечисления.ВидыОперацийПоЗарплате.ПФРДоПредельнойВеличиныОценочныеОбязательства);
	ВидыОперацийФонды.Добавить(Перечисления.ВидыОперацийПоЗарплате.ПФРПоСуммарномуТарифу);
	ВидыОперацийФонды.Добавить(Перечисления.ВидыОперацийПоЗарплате.ПФРПоСуммарномуТарифуОценочныеОбязательства);
	ВидыОперацийФонды.Добавить(Перечисления.ВидыОперацийПоЗарплате.ПФРСтраховаяЧасть);
	ВидыОперацийФонды.Добавить(Перечисления.ВидыОперацийПоЗарплате.ПФРСтраховаяЧастьОценочныеОбязательства);
	ВидыОперацийФонды.Добавить(Перечисления.ВидыОперацийПоЗарплате.РасходыПоСтрахованиюФСС); 
	ВидыОперацийФонды.Добавить(Перечисления.ВидыОперацийПоЗарплате.РасходыПоСтрахованиюФССНС); 
	ВидыОперацийФонды.Добавить(Перечисления.ВидыОперацийПоЗарплате.ФСС);
	ВидыОперацийФонды.Добавить(Перечисления.ВидыОперацийПоЗарплате.ФССОценочныеОбязательства);
	ВидыОперацийФонды.Добавить(Перечисления.ВидыОперацийПоЗарплате.ФССНС);
	ВидыОперацийФонды.Добавить(Перечисления.ВидыОперацийПоЗарплате.ФССНСОценочныеОбязательства);
	ВидыОперацийФонды.Добавить(Перечисления.ВидыОперацийПоЗарплате.ТФОМС);
	ВидыОперацийФонды.Добавить(Перечисления.ВидыОперацийПоЗарплате.ТФОМСОценочныеОбязательства);
	ВидыОперацийФонды.Добавить(Перечисления.ВидыОперацийПоЗарплате.ФФОМС);
	ВидыОперацийФонды.Добавить(Перечисления.ВидыОперацийПоЗарплате.ФФОМСОценочныеОбязательства);
	ВидыОперацийФонды.Добавить(Перечисления.ВидыОперацийПоЗарплате.ПФРДополнительныйТарифЛЭОтпускАвансом); 
	ВидыОперацийФонды.Добавить(Перечисления.ВидыОперацийПоЗарплате.ПФРДополнительныйТарифШахтерыОтпускАвансом);
	ВидыОперацийФонды.Добавить(Перечисления.ВидыОперацийПоЗарплате.ПФРДоПредельнойВеличиныОтпускАвансом);
	ВидыОперацийФонды.Добавить(Перечисления.ВидыОперацийПоЗарплате.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахБезСпецОценкиОтпускАвансом);
	ВидыОперацийФонды.Добавить(Перечисления.ВидыОперацийПоЗарплате.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахОтпускАвансом);
	ВидыОперацийФонды.Добавить(Перечисления.ВидыОперацийПоЗарплате.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахСпецОценкаОтпускАвансом);
	ВидыОперацийФонды.Добавить(Перечисления.ВидыОперацийПоЗарплате.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахБезСпецОценкиОтпускАвансом);
	ВидыОперацийФонды.Добавить(Перечисления.ВидыОперацийПоЗарплате.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахОтпускАвансом);
	ВидыОперацийФонды.Добавить(Перечисления.ВидыОперацийПоЗарплате.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахСпецОценкаОтпускАвансом);
	ВидыОперацийФонды.Добавить(Перечисления.ВидыОперацийПоЗарплате.ПФРНакопительнаяЧастьОтпускАвансом);
	ВидыОперацийФонды.Добавить(Перечисления.ВидыОперацийПоЗарплате.ПФРПоСуммарномуТарифуОтпускАвансом); 
	ВидыОперацийФонды.Добавить(Перечисления.ВидыОперацийПоЗарплате.ПФРСПревышенияОтпускАвансом);
	ВидыОперацийФонды.Добавить(Перечисления.ВидыОперацийПоЗарплате.ПФРСтраховаяЧастьОтпускАвансом);
	ВидыОперацийФонды.Добавить(Перечисления.ВидыОперацийПоЗарплате.ТФОМСОтпускАвансом);
	ВидыОперацийФонды.Добавить(Перечисления.ВидыОперацийПоЗарплате.ФССНСОтпускАвансом);
	ВидыОперацийФонды.Добавить(Перечисления.ВидыОперацийПоЗарплате.ФССОтпускАвансом);
	ВидыОперацийФонды.Добавить(Перечисления.ВидыОперацийПоЗарплате.ФФОМСОтпускАвансом);
	ВидыОперацийФонды.Добавить(Перечисления.ВидыОперацийПоЗарплате.ВзносыПоЕдиномуТарифу);
	ВидыОперацийФонды.Добавить(Перечисления.ВидыОперацийПоЗарплате.ВзносыПоЕдиномуТарифуОценочныеОбязательства);
	ВидыОперацийФонды.Добавить(Перечисления.ВидыОперацийПоЗарплате.ВзносыПоЕдиномуТарифуОтпускАвансом);
	
	Возврат ВидыОперацийФонды;
	
КонецФункции

Функция НалогСборПлатежПоУмолчанию(Организация, ВидНалога) Экспорт
	
	Если ЗначениеЗаполнено(ВидНалога) Тогда
		
		Возврат Справочники.НалогиИПлатежиОрганизации.НалогСборПлатежПоУмолчанию(Организация, ВидНалога); 
		
	Иначе
		
		Возврат Справочники.НалогиИПлатежиОрганизации.ПустаяСсылка();
		
	КонецЕсли;
	
КонецФункции

#Область ОбновлениеИнформационнойБазы

Процедура ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОтражениеЗарплатыВУчете.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ОтражениеЗарплатыВУчете КАК ОтражениеЗарплатыВУчете";
	
	ОбновлениеИнформационнойБазы.ОтметитьКОбработке(Параметры, Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));
	
КонецПроцедуры

Процедура ОбработатьДанныеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	Параметры.ОбработкаЗавершена = Ложь;
	ПолноеИмяОбъекта = "Документ.ОтражениеЗарплатыВУчете";
	Выборка = ОбновлениеИнформационнойБазы.ВыбратьСсылкиДляОбработки(Параметры.Очередь, ПолноеИмяОбъекта);
	
	Пока Выборка.Следующий() Цикл
		
		НачатьТранзакцию();
		
		Попытка
			ПредставлениеОбъекта = Строка(Выборка.Ссылка);
			
			Блокировка = Новый БлокировкаДанных;
			Элемент = Блокировка.Добавить(ПолноеИмяОбъекта);
			Элемент.УстановитьЗначение("Ссылка", Выборка.Ссылка);
			Элемент.Режим = РежимБлокировкиДанных.Исключительный;
			
			Блокировка.Заблокировать();
			
			Объект = Выборка.Ссылка.ПолучитьОбъект(); // ДокументОбъект.ОтражениеЗарплатыВУчете
			ОбъектИзменен = Ложь;
			Если Объект <> Неопределено Тогда 
				Объект.Заблокировать();
				
				Для Каждого Строка ИЗ Объект.Операции Цикл
					Если НалоговыйУчетКлиентСервер.ОтражатьВНалоговомУчете(Объект.Организация, Объект.Дата, Строка.КФО) Тогда
						Строка.СуммаНУ = Строка.Сумма;
					КонецЕсли;
				КонецЦикла;
				
				ОбъектИзменен = Истина;
			КонецЕсли;
				
			Если ОбъектИзменен Тогда
				ОбновлениеИнформационнойБазы.ЗаписатьОбъект(Объект);
			Иначе
				ОбновлениеИнформационнойБазы.ОтметитьВыполнениеОбработки(Выборка.Ссылка);
			КонецЕсли;
			
			ЗафиксироватьТранзакцию();
		
		Исключение
			
			ОтменитьТранзакцию();
			
			ТекстСообщения = НСтр("ru = 'Не удалось записать документ: %Документ% по причине: %Причина%'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Документ%", ПредставлениеОбъекта);
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Причина%", ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
				УровеньЖурналаРегистрации.Предупреждение,
				Метаданные.Документы.ОтражениеЗарплатыВУчете,
				Выборка.Ссылка,
				ТекстСообщения);
			ВызватьИсключение;
		
		КонецПопытки;
		
	КонецЦикла;
	
	Параметры.ОбработкаЗавершена = Не ОбновлениеИнформационнойБазы.ЕстьДанныеДляОбработки(Параметры.Очередь, ПолноеИмяОбъекта);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти 

#Область УстаревшиеПроцедурыИФункции

// Устарела. Следует использовать БухгалтерскийУчет.СписокКЭК()
//
Функция ПолучитьМассивКОСГУ(КОСГУ) Экспорт
	
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("КОСГУ");
	
	СписокКЭК = БухгалтерскийУчет.СписокКЭК(КОСГУ);
	Для Каждого КЭК Из СписокКЭК Цикл
		Результат.Добавить().КОСГУ = КЭК;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецЕсли
